{ 
    "title": "철학을 중요하다고 느낀 이유", 
    "subTitle": "2025-05-02", 
    "content": [
        "철학의 중요성을 NLP에게 배웠다. 정말 이게 맞나 싶다.",
        "",
        "어쩌다 이리 되었냐면... ",
        "일단 GPT랑 얘기를 좀 하고 있었다.",
        "확률에 기반하여 대화를 이해하는 것처럼 보이는 것이 아니라, 실제로 대화를 이해하는 논리 알고리즘을 만들고 싶다는 생각에 도달하여 그 방법을 모색하고 있었는데,",
        "문득 이런 생각이 들었다.",
        "",
        "과연 인간은 정말로 이해하고 있는 것인가.",
        "인간도 결국 반복된 학습을 통해 패턴을 파악하고 확률적으로 높게 일치하는 대답을 하는 것뿐 아닌가.",
        "인간과 현재 NLP의 차이는 결국 sense perception, 감각 지각의 유무아닌가.",
        "",
        "이 sense perception에 대해서도 의문이 있다.",
        "내가 보고 있는 물체가, 실제로 다른 사람의 눈에도 정확하게 일치하게 보이는가에 대한 근거가 있는가.",
        "서로의 눈에는 다르게 보이지만, 이걸 어떻게 부르는지를 학습하여 대화가 통하는 것은 아닌가.",
        "실제로 우리 세상에서 대화로 의사소통하고 있지만, 이게 실제로 의사소통이 되고 있다는 증거가 있는가.",
        "예를 들어, 고양이가 아주아주 작은 확률로, 인간과 같은 말을 했다고 치자. 고양이가 갑자기 '오랜만이군. 오늘은 날씨가 덥네'라고 음성신호를 입으로 내었다고 가정하자.",
        "그러면 이건 과연 의사소통이 되고 있는 것인가? 아마 우연일 것이다.",
        "그 다음부터는 다시 야옹거리기 시작했으니까.",
        "고양이가 이 말을 하면서 땀을 닦고 있다.",
        "우연일 것이다. 그 다음에는 평범한 고양이처럼 행동했으니까.",
        "근데 우연의 우연으로 그 다음의 행동이 있다.",
        "'아 목말라'라면서 물을 마시기 시작한다.",
        "이건 우연에 우연의 일치인 것이다.",
        "만약 이것이 극도로 적은 확률로 연속된다면?",
        "한평생을 평생 인간과 같은 말을 하며 행동도 일관되게 살았다면?",
        "아주 작은 우연.",
        "이 고양이가 무수히 많다면?",
        "더 작은 우연.",
        "이걸 인간이라고 치면?",
        "우연이다.",
        "인간사회의 모든 의사소통이 우연이라는 가능성이 존재한다.",
        "",
        "그렇다면, 인간의 이해가 절대적으로 옳다는 가정이 성립하지 못한다.",
        "그럼 NLP의 경우는?",
        "인간의 이해와 NLP의 차이는, sense perception을 통해서 세상을 볼 수 있는가? -로 정의할 수 있...을까?",
        "아, 머리가 이상하다.",
        "마치 테드 창의 소설에서, 기계 팔과 반사경을 통해서 내 뇌를 열어서 관측하던 중에 '나는 과연 어디에 있는가'라는 의문을 가지는 것처럼 무한의 굴레에 빠진 기분이다. ",
        "",
        "아무튼 다시 돌아와서.",
        "하고 싶은 얘기가 뭐냐면,",
        "현시점의 NLP가 인간처럼 지식을 이해하지 못한다는 점을 역설하면,",
        "인간이 NLP처럼 이해하지 못한다고도 말할 수 있다는 것이다.",
        "인간의 이해방식이 NLP의 이해방식보다 고차원적이라고 단언할 수 있는가?",
        "인간의 sense perception으로 이해하지 못하는 범주까지 어쩌면 NLP는 이해할 수도 있다.",
        "4차원 이상의 논리라던가, 빛보다 빠른 것의 상정이라던가.",
        "세상의 물리법칙도 결국에는 인간의 sense perception안에 한정되어 있는 것이다.",
        "보거나 듣지 못하는 것들은 인지할 수 없으니.",
        "",
        "다시 원점으로 돌아와서.",
        "왜 이 생각을 하게 되었는가.",
        "인공지능이 인간처럼 생각하게 하려면,",
        "인간이 어떻게 생각하는지를 알아야 한다.",
        "근데 인간이 어떻게 생각하는지를 생각해보니, 이게 잘 모르겠단 말이다.",
        "",
        "그래서 일단은 자연어처리에 대한 공부를 무작정 하고 싶다는 자세보다는,",
        "철학적인 생각을 계속 해보는 게 오히려 더 도움이 될 수 있을 것 같다.",
        "결국 기계가 인간의 말을 알아듣게 하려면, 인간이 인간의 말을 어떻게 알아듣는지를 알아야하는데,",
        "이게 생각보다 쉬운 문제가 아니다.",
        "과연 인공지능의 성배라고 불릴만하다."

    ]
}